<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MajorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $majors = [
            // ----คณะวิทยาศาสตร์----
            ['name' => 'คณิตศาสตร์', 'faculty_id' => 1],
            ['name' => 'เคมี', 'faculty_id' => 1],
            ['name' => 'ชีววิทยา', 'faculty_id' => 1],
            ['name' => 'จุลชีววิทยา', 'faculty_id' => 1],
            ['name' => 'ฟิสิกส์วัสดุและนาโนเทคโนโลยี ', 'faculty_id' => 1],
            ['name' => 'วิทยาการคอมพิวเตอร์', 'faculty_id' => 1],
            ['name' => 'เทคโนโลยีสารสนเทศ', 'faculty_id' => 1],
            ['name' => 'วิทยาศาสตร์สิ่งแวดล้อม ', 'faculty_id' => 1],
            ['name' => 'วิทยาศาสตร์การประมงและทรัพยากรทางน้ำ', 'faculty_id' => 1],

            // ----คณะวิทยาการสุขภาพและการกีฬา----
            ['name' => 'สาธารณสุขชุมชน', 'faculty_id' => 2],
            ['name' => 'อาชีวอนามัยและความปลอดภัย', 'faculty_id' => 2],
            ['name' => 'วิทยาศาสตร์การกีฬา', 'faculty_id' => 2],
            ['name' => 'การแพทย์แผนไทย', 'faculty_id' => 2],
            ['name' => 'สาธารณสุขศาสตร์ ', 'faculty_id' => 2],

            // ----คณะเทคโนโลยีและการพัฒนาชุมชน----
            ['name' => 'สัตวศาสตร์', 'faculty_id' => 3],
            ['name' => 'ส่งเสริมการเกษตรและพัฒนาชุมชน', 'faculty_id' => 3],
            ['name' => 'เทคโนโลยีและนวัตกรรมการผลิตพื', 'faculty_id' => 3],

            // ----คณะวิศวกรรมศาสตร์----
            ['name' => 'วิศวกรรมเมคคาทรอนิกส์', 'faculty_id' => 4],
            ['name' => 'วิศวกรรมยางและพอลิเมอร์', 'faculty_id' => 4],
            ['name' => 'วิศวกรรมเครื่องกล', 'faculty_id' => 4],

            // ----คณะพยาบาลศาสตร์----
            ['name' => 'พยาบาลศาสตร์', 'faculty_id' => 5],

            // ----คณะนิติศาสตร์----
            ['name' => 'คณะนิติศาสตร์', 'faculty_id' => 6],

            // ----คณะอุตสาหกรรมเกษตรและชีวภาพ----
            ['name' => 'วิทยาศาสตร์และเทคโนโลยีอาหาร', 'faculty_id' => 7],
            ['name' => 'เทคโนโลยีเครื่องสำอางและผลิตภัณฑ์เสริมอาหาร', 'faculty_id' => 7],

            // ----คณะศึกษาศาสตร์ ----
            ['name' => 'เทคโนโลยีและสื่อสารการศึกษา', 'faculty_id' => 8],
            ['name' => 'การประเมินผลและวิจัย', 'faculty_id' => 8],
            ['name' => 'หลักสูตรและการสอน', 'faculty_id' => 8],
            ['name' => 'การบริหารการศึกษา', 'faculty_id' => 8],
            ['name' => 'พลศึกษาและสุขศึกษา', 'faculty_id' => 8],
            ['name' => 'จิตวิทยา', 'faculty_id' => 8],
            ['name' => 'การสอนวิทยาศาสตร์และคณิตศาสตร์', 'faculty_id' => 8],
            ['name' => 'การสอนศิลปศาสตร์', 'faculty_id' => 8],

        ];

        DB::table('majors')->insert($majors);
    }
}
